Repository: nortoy13/code-craft-project
Catalog: codecraft/locale/*/LC_MESSAGES/django.po
Languages: ru

source: O‘zbek
ru: Uzbek

source: Русский
ru: Russian

source: Dushanba
ru: Понедельник

source: Seshanba
ru: Вторник

source: Chorshanba
ru: Среда

source: Payshanba
ru: Четверг

source: Juma
ru: Пятница

source: Shanba
ru: Суббота

source: Yakshanba
ru: Воскресенье

source: Asosiy sahifa
ru: Главная

# menu
source: Biz haqimizda
ru: О нас

# heading
source: Biz haqimizda
ru: О нас

source: Biz haqimizda Codecraft IT o‘quv markazi – bu zamonaviy texnologiyalar bo‘yicha sifatli ta’lim berishga ixtisoslashgan markaz bo‘lib, dasturlash, dizayn va IT sohasidagi eng talabgir yo‘nalishlarni o‘rgatishga qaratilgan. Bizning maqsadimiz IT sohasida mukammal bilim va amaliy tajribaga ega bo‘lgan mutaxassislarni tayyorlash. O‘quvchilarimiz nafaqat nazariy bilim oladi, balki real loyihalar ustida ishlash orqali amaliy ko‘nikmalarga ham ega bo‘ladilar. Bizning afzalliklarimiz ✅ Tajribali mentorlar – IT sohasi bo‘yicha katta tajribaga ega ustozlar. ✅ Zamonaviy dasturlar – O‘quv kurslari eng so‘nggi texnologiyalar va talablar asosida tuzilgan. ✅ Amaliy mashg‘ulotlar – O‘quvchilar har bir darsda o‘z bilimlarini mustahkamlash imkoniyatiga ega. ✅ Ishga joylashish imkoni – Eng yaxshi o‘quvchilarimizga IT kompaniyalarga ishga joylashishda yordam beramiz. ✅ Qulay o‘quv muhiti – IT sohasiga mos jihozlangan zamonaviy o‘quv xonalari. Bizning kurslarimiz 💻 Dasturlash: Python, JavaScript, Java, C++, PHP, Django, React, Node.js 🎨 Grafik va UI/UX dizayn: Photoshop, Figma, Illustrator 📊 Ma’lumotlar bazasi va Sun’iy intellekt: SQL, Data Science, Machine Learning 🔒 Kiberxavfsizlik va DevOps: Linux, Ethical Hacking, AWS, Docker
ru: О нас Учебный центр Codecraft IT – это специализированный центр, ориентированный на качественное обучение современным технологиям, программированию, дизайну и востребованным направлениям в сфере IT. Наша цель Подготовка специалистов с глубокими знаниями и практическим опытом в IT. Наши студенты получают не только теоретические знания, но и практические навыки, работая над реальными проектами. Наши преимущества ✅ Опытные наставники – преподаватели с большим опытом работы в IT. ✅ Актуальные программы – учебные курсы разработаны на основе современных технологий и требований рынка. ✅ Практические занятия – студенты могут закреплять знания на каждом уроке. ✅ Помощь в трудоустройстве – мы помогаем нашим лучшим студентам устроиться на работу в IT-компании. ✅ Комфортная учебная среда – современные учебные классы, оснащенные необходимым оборудованием. Наши курсы 💻 Программирование: Python, JavaScript, Java, C++, PHP, Django, React, Node.js 🎨 Графический и UI/UX дизайн: Photoshop, Figma, Illustrator 📊 Базы данных и Искусственный интеллект: SQL, Data Science, Machine Learning 🔒 Кибербезопасность и DevOps: Linux, Ethical Hacking, AWS, Docker

source: Bizning natijalarimiz
ru: Наши результаты

source: bitiruvchilar
ru: Выпускники

source: kurslar
ru: Курсы

source: filiallar
ru: Филиалы

source: Bepul ochiq darsimizga yoziling
ru: Запишитесь на бесплатный открытый урок

source: Har bir kurs boshlanishidan oldin bepul ochiq darslar o'tkaziladi, unda siz ta'lim jarayoni haqida batafsil ma'lumot olasiz, o‘qituvchi bilan tanishasiz va kursga yozilishingiz mumkin.
ru: Перед началом каждого курса проводятся бесплатные открытые уроки, на которых вы сможете получить подробную информацию об учебном процессе, познакомиться с преподавателем и записаться на курс.

source: Ism familiya:
ru: Имя и фамилия:

source: Telefon raqam:
ru: Номер телефона:

source: Sizning so‘rovingiz:
ru: Ваш запрос:

source: Yuborish
ru: Отправить

source: Ijtimoiy tarmoqlar:
ru: Социальные сети:

source: Kurslar
ru: Курсы

source: Biz haqimizda
ru: О нас

source: Yangiliklar
ru: Новости

source: Loyihalar
ru: Проекты

source: Aloqa
ru: Контакты

# nav
source: Ariza qoldirish
ru: Оставить заявку

source: Manzil
ru: Адрес

source: 171-mabtab, 20-kabinet, Buyuk Ipak Yo`li, 153. Mo`ljal: Sayohat mehmonhonasi
ru: 171-я школа, 20-й кабинет, Великий Шёлковый путь, 153. Ориентир: Гостиница Саёхат

# footer
source: Ariza qoldirish
ru: Оставить заявку

source: Ish vaqtlari: 10:00 - 20:00
ru: Рабочее время: 10:00 - 20:00

source: Muhabbat bilan 💛 Codecraft ©
ru: С любовью 💛 Codecraft ©

# menu
source: Aloqa
ru: Контакты

# heading
source: Aloqa
ru: Контакты

source: Ariza qoldirish
ru: Оставить заявку

source: Ushbu ma’lumotlarni to‘ldiring
ru: Заполните эту информацию

source: Email:
ru: Электронная почта:

source: Yo‘nalish
ru: Направление

source: Telefon:
ru: Телефон:

source: Ish vaqtlari:
ru: Рабочее время:

source: Dush-Jum:
ru: Пон-Пят:

source: Shan-Yak:
ru: Суб-Вос:

source: Ijtimoy tarmoqlar:
ru: Социальные сети:

source: 1-Filial
ru: Филиал 1

source: 241-maktab, 6-xona, Salom ko‘chasi 1.
ru: Школа №241, кабинет 6, улица Салом 1.

source: Mo‘ljal: Salom choyxonasi
ru: Ориентир: чайхана Салом

source: 2-Filial:
ru: Филиал 2

source: 171-maktab, 20-xona, Buyuk Ipak Yo‘li 153.
ru: Школа №171, кабинет 20, улица Великий Шелковый Путь 153.

source: Mo‘ljal: Sayohat mehmonxonasi
ru: Ориентир: гостиница Сайохат

source: 3-Filial:
ru: Филиал 3

source: INHA, B bloki, 204-xona.
ru: ИНХА, блок Б, кабинет 204.

source: Ziyolilar, 9a Buz-1 MFY, Mirzo Ulug‘bek tumani.
ru: Зиёлилар, 9а Буз-1 МФЙ, Мирзо-Улугбекский район.

source: Kurs haqida batafsil
ru: Подробнее о курсе

source: Kurs o`z ichiga oladi
ru: Курс включает

source: Darslar
ru: Занятия

source: Amaliyot
ru: Практика

source: Portfolio uchun ishlar
ru: Проекты для портфолио

source: Kurs dasturi
ru: Программа курса

source: Kurs narxlari
ru: Стоимость курса

source: O‘quv oyi 8 ta darsdan iborat. To‘lov mashg‘ulotlar boshlanishidan oldin amalga oshiriladi.
ru: Учебный месяц включает 8 занятий. Оплата производится до начала обучения.

source: Tez-tez beriladigan savollar
ru: Часто задаваемые вопросы

source: O‘quvchilarimiz tomonidan eng ko‘p beriladigan savollarga javoblarni ushbu bo‘limda topishingiz mumkin. Agar sizni qiziqtirgan savol bo‘lsa, biz bilan bog‘laning!
ru: В этом разделе вы можете найти ответы на самые частые вопросы наших учеников. Если у вас есть интересующий вопрос, свяжитесь с нами!

source: Kurs natijalari
ru: Результаты курса

source: Har bir kurs davomida o‘quvchilar nazariy bilimlarni o‘zlashtirish bilan birga, amaliy loyihalar ustida ham ishlaydilar. Dasturlash kurslarida real ilovalar yaratish, dizayn kurslarida esa grafik va UI/UX loyihalar ishlab chiqish mashg‘ulotlari o‘tkaziladi. Kurs yakunida esa bitiruvchilar tayyor portfolio va sertifikatga ega bo‘ladilar.
ru: В каждом курсе студенты не только осваивают теоретические знания, но и работают над практическими проектами. На курсах программирования они разрабатывают реальные приложения, а на курсах дизайна создают графические и UI/UX проекты. По завершении курса выпускники получают готовое портфолио и сертификат.

source: Ochiq darslar
ru: Открытые уроки

source: Code Craft IT kasblarini o`rgatish maskani
ru: Code Craft — центр обучения IT-профессиям

source: Codecraft ta’lim maskani orqali siz IT kasblarini belgilangan muddat orqali 0 dan mukammal darajagacha o‘rganishingiz mumkin.
ru: В образовательном центре Codecraft вы можете изучить IT-профессии с нуля до совершенного уровня за установленный срок.

source: Biz haqimizda ko‘proq
ru: Подробнее о нас

source: Bitiruvchilar
ru: Выпускники

source: Trening soatlari
ru: Часы тренингов

source: Mutaxasisslar
ru: Специалисты

source: Nima uchun Codecraft?
ru: Почему Codecraft?

source: O‘quv markazlar orasidan nima uchun aynan Codecraft o‘quv markazini tanlashingiz uchun 4 sababni keltirib o‘tamiz.
ru: Мы расскажем вам о 4 причинах, почему стоит выбрать именно учебный центр Codecraft среди других образовательных учреждений.

source: Eng zo'r o'qituvchilar
ru: Лучшие преподаватели

source: Bizning tajribali o‘qituvchilarimiz o‘z sohasida yetakchi bo‘lib, har bir o‘quvchiga individual yondashadi.
ru: Наши опытные преподаватели являются лидерами в своей сфере и индивидуально подходят к каждому ученику.

source: Amaliy mashg'ulotlar
ru: Практические занятия

source: O‘quvchilar nazariy bilimlarni mustahkamlash uchun real loyihalar ustida ishlash imkoniyatiga ega bo‘ladilar.
ru: Студенты получают возможность работать над реальными проектами, чтобы укрепить свои теоретические знания.

source: Sertifikat va portfolio
ru: Сертификат и портфолио

source: Kurs yakunida siz rasmiy sertifikat hamda mustaqil ishlagan loyihalaringiz bilan to‘ldirilgan portfolio olasiz.
ru: По окончании курса вы получите официальный сертификат и портфолио, содержащее выполненные вами проекты.

source: Doimiy qo‘llab-quvvatlash
ru: Постоянная поддержка

source: Bizning mutaxassislarimiz sizga kurs davomida ham, undan keyin ham yordam berishga tayyor.
ru: Наши специалисты готовы помочь вам как во время курса, так и после его окончания.

source: Aktual kurslar
ru: Актуальные курсы

source: Bizning eng so‘nggi va dolzarb kurslarimiz bilan tanishing. Hozirgi talab yuqori bo‘lgan kasblarni o‘rganing va kelajagingizga mustahkam poydevor yarating.
ru: Ознакомьтесь с нашими последними и актуальными курсами. Изучайте востребованные профессии и создавайте прочный фундамент для своего будущего.

source: Batafsil
ru: Подробнее

source: Qulay holatda ta’lim
ru: Обучение в удобном формате

source: Siz istalgan joyda va qulay vaqtda ta’lim olishingiz mumkin. Onlayn va oflayn darslar, zamonaviy metodikalar va interaktiv mashg‘ulotlar siz uchun!
ru: Вы можете учиться в любое время и в любом месте. Онлайн и офлайн занятия, современные методики и интерактивные уроки — всё для вас!

source: Biz kimmiz?
ru: Кто мы?

source: Video orqali barcha savollaringizga javob olasiz!
ru: Получите ответы на все ваши вопросы через видео!

source: Izohlar
ru: Отзывы

source: Bizning o‘quvchilarimizning fikr-mulohazalari va izohlari bilan tanishing. Ular kurslarimiz haqidagi tajribalarini bo‘lishadilar!
ru: Ознакомьтесь с отзывами и комментариями наших студентов. Они делятся своим опытом о наших курсах!

source: O‘quvchilarimiz qayerda ishlashadi?
ru: Где работают наши студенты?

source: Bizning bitiruvchilarimiz yirik IT kompaniyalarda, startaplarga asos solib yoki frilanser sifatida faoliyat yuritishadi. Ular o‘z bilimlarini amalda qo‘llab, muvaffaqiyatli martaba qurmoqdalar.
ru: Наши выпускники работают в крупных IT-компаниях, создают стартапы или работают фрилансерами. Они применяют свои знания на практике и строят успешную карьеру.

source: Boshqa yangiliklar
ru: Другие новости
